In [2]:
# Video 1

import pandas as pd
import numpy as np #importing pandas and numpy libraries

In [3]:
# Data Structures
# Creating the Series

In [4]:
# temp=[1,2,3]
temp=np.array([1,2,3])

df=pd.Series(temp,index=['Alex','John','Ana']) #a series can be made with both a list and a numpy array

In [5]:
df

Alex    1
John    2
Ana     3
dtype: int32

In [6]:
temp={'Alex':1,'John':2,'Ana':3}

df=pd.Series(temp) #My advice for you to make a series is through a dictionary. It helps us managing the index
df

Alex    1
John    2
Ana     3
dtype: int64

In [7]:
# DataFrames: The most important reason, we use Pandas. DataFrame is a 2D (Tabular) data.
# temp1 = [1,2,3,4,5]
temp1 = np.array([1,2,3,4,5])

df2=pd.DataFrame(temp1) # A DataFrame can also be made through a list and a numpy array (Similar to a series)
df2

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
data = [['Alex',10],['John',25],['Ana',35]] # Nested list is required to make a 2D DataFrame with lists

In [9]:
pd.DataFrame(data, columns=['Name','Age']) # Always introduce columns

   Name  Age
0  Alex   10
1  John   25
2   Ana   35

In [10]:
data2 = {'Name':['Alex','John','Ana'],'Age':[10,25,35]} # Again, it is always adviced to make a DataFrame using a Dictionary.

In [11]:
df2 = pd.DataFrame(data2,index=['first','second','third']) # Indexing gives us row headers. It is good to make an index otherwise it uses np.arange as default index
df2

        Name  Age
first   Alex   10
second  John   25
third    Ana   35

In [12]:
# Video 2

df2['Name'] # Selection of a column in a DataFrame

first     Alex
second    John
third      Ana
Name: Name, dtype: object

In [13]:
df2['Name'][1] # Selecting a cell in a column

'John'

In [14]:
df2.iloc[2] # Selection of a row using index number

Name    Ana
Age      35
Name: third, dtype: object

In [15]:
df2.loc['second'] # Selection of a row using index value (allocated by us while making the dataframe)

Name    John
Age       25
Name: second, dtype: object

In [16]:
# adding a column

df2['Country']=['India','US','Spain'] # Using this way to add a column sometimes creates indexing problem

In [17]:
df2

        Name  Age Country
first   Alex   10   India
second  John   25      US
third    Ana   35   Spain

In [18]:
df2['Occupation']=pd.Series(['Student','Analyst','Managing Director'],index=df2.index) # Using Series to add a column is always recommended
df2

        Name  Age Country         Occupation
first   Alex   10   India            Student
second  John   25      US            Analyst
third    Ana   35   Spain  Managing Director

In [19]:
df2.drop(columns=['Age'], inplace = True) # Always use drop to delete a column or a row

In [20]:
df2

        Name Country         Occupation
first   Alex   India            Student
second  John      US            Analyst
third    Ana   Spain  Managing Director

In [21]:
df2[1:3] # Selection of some rows

        Name Country         Occupation
second  John      US            Analyst
third    Ana   Spain  Managing Director

In [22]:
df2.columns[1] # Column Names

'Country'

In [23]:
# Video 3

# addtion of rows: It is a bit more complicated than addition of column

more_data = ['Ritvik','India','Financial Programmer']

df3 = pd.DataFrame({df2.columns[0]:more_data[0],df2.columns[1]:more_data[1],df2.columns[2]:more_data[2]},index=['forth'])
df2 = df2.append(df3) # Making a new DataFram and using append is a smart way to add a row
df2

          Name Country            Occupation
first     Alex   India               Student
second    John      US               Analyst
third      Ana   Spain     Managing Director
forth   Ritvik   India  Financial Programmer

In [24]:
df3

         Name Country            Occupation
forth  Ritvik   India  Financial Programmer

In [25]:
df2.drop(['forth'], inplace =True) # Always use drop to delete a column or a row

In [26]:
df2

        Name Country         Occupation
first   Alex   India            Student
second  John      US            Analyst
third    Ana   Spain  Managing Director

In [27]:
df2.tail(2) # Tail gives us top 5 rows. 2 in paranthesis gives us top 2 rows

        Name Country         Occupation
second  John      US            Analyst
third    Ana   Spain  Managing Director

In [28]:
df2.head(2) # Head gives us bottom 5 rows. 2 in paranthesis gives us bottom 2 rows

        Name Country Occupation
first   Alex   India    Student
second  John      US    Analyst

In [29]:
df2.values #It converts a DataFrame in array format.

array([['Alex', 'India', 'Student'],
       ['John', 'US', 'Analyst'],
       ['Ana', 'Spain', 'Managing Director']], dtype=object)

In [30]:
df2.index # It outputs index names

Index(['first', 'second', 'third'], dtype='object')

In [31]:
df2

        Name Country         Occupation
first   Alex   India            Student
second  John      US            Analyst
third    Ana   Spain  Managing Director

In [32]:
# Video 4
df2.shape # Shape outputs dimensions of a DataFrame

(3, 3)

In [33]:
df2.size # It gives total number of objects inside a DataFrame. It is similar to len() for a list.

# temp1=[1,2,3,4]
# len(temp1)

9

In [34]:
df2.T  #One of the most useful functionality of Pandas for DataFrame. Transpose is used a lot it we want to change index temporarily.

              first   second              third
Name           Alex     John                Ana
Country       India       US              Spain
Occupation  Student  Analyst  Managing Director

In [35]:
df2['Age'] = pd.Series([10,25,35],index = df2.index) # adding a column

In [36]:
df2

        Name Country         Occupation  Age
first   Alex   India            Student   10
second  John      US            Analyst   25
third    Ana   Spain  Managing Director   35

In [37]:
df2.mean() # It gives average of all numerical figure columns

Age    23.333333
dtype: float64

In [38]:
df2.sum() # It gives sum of all numerical figure columns, however, it attaches all texts as well.

Name                              AlexJohnAna
Country                          IndiaUSSpain
Occupation    StudentAnalystManaging Director
Age                                        70
dtype: object

In [39]:
df2.std() #It gives standard Deviation of all numerical figure columns

Age    12.583057
dtype: float64

In [40]:
#count, median, mode, min, max, abs, prod etc.

In [41]:
df2.describe() # It gives a brief description of  all numerical figure columns

             Age
count   3.000000
mean   23.333333
std    12.583057
min    10.000000
25%    17.500000
50%    25.000000
75%    30.000000
max    35.000000

In [42]:
# Video 5

df2[['Name','Age']] # Scooping out a part of DataFrame

        Name  Age
first   Alex   10
second  John   25
third    Ana   35

In [43]:
df2

        Name Country         Occupation  Age
first   Alex   India            Student   10
second  John      US            Analyst   25
third    Ana   Spain  Managing Director   35

In [44]:
df2.loc[['first','second']] [['Name','Age']] # Scooping out a part of DataFrame: Working on both the columns and rows

        Name  Age
first   Alex   10
second  John   25

In [45]:
df2.iloc[[0,1]][['Name','Age']] # Scooping out a part of DataFrame using index numbers: Working on both the columns and rows

        Name  Age
first   Alex   10
second  John   25

In [46]:
df2.at['second','Age'] #.at is used to extract value of a particular cell.

25

In [47]:
df2.iat[2,2] #.iat is used to extract value of a particular cell: It used actual coordinate values

'Managing Director'

In [53]:
df2

        Name Country         Occupation  Age  Income
first   Alex   India            Student   10   10000
second  John      US            Analyst   25   40000
third    Ana   Spain  Managing Director   35  100000

In [54]:
# Video 6
# filters

df2[df2['Age']<30] # Putting one filter

        Name Country Occupation  Age  Income
first   Alex   India    Student   10   10000
second  John      US    Analyst   25   40000

In [55]:
df2[(df2['Age']<30) & (df2['Age']>20)] # Putting two filters simultaneously using AND logic date

        Name Country Occupation  Age  Income
second  John      US    Analyst   25   40000

In [57]:
df2[(df2['Age']<20) | (df2['Age']>30)] # Using OR logic gate

       Name Country         Occupation  Age  Income
first  Alex   India            Student   10   10000
third   Ana   Spain  Managing Director   35  100000

In [58]:
df2[(df2['Age']<30) ^ (df2['Age']>15)] # Using XOR logic gate

       Name Country         Occupation  Age  Income
first  Alex   India            Student   10   10000
third   Ana   Spain  Managing Director   35  100000

In [51]:
df2['Income'] = pd.Series([10000,40000,100000],index=df2.index)  #adding a column
df2

        Name Country         Occupation  Age  Income
first   Alex   India            Student   10   10000
second  John      US            Analyst   25   40000
third    Ana   Spain  Managing Director   35  100000

In [59]:
df2[(df2['Age']<30) & (df2['Income']>20000)]  #complicated filters

        Name Country Occupation  Age  Income
second  John      US    Analyst   25   40000

In [60]:
df2.index = ['1st','2nd','3th'] # Changing the index values
df2

     Name Country         Occupation  Age  Income
1st  Alex   India            Student   10   10000
2nd  John      US            Analyst   25   40000
3th   Ana   Spain  Managing Director   35  100000

In [61]:
# Video 7

# Changing the index type

s2 = pd.Series([3, 4, 5], index=['0', '1', '2']) # A series with string formated numerical values
s2

0    3
1    4
2    5
dtype: int64

In [65]:
s2.index.values.astype('float64') # Changing index type to float (decimals)

array([0., 1., 2.])

In [66]:
s2

0    3
1    4
2    5
dtype: int64

In [67]:
df_1 = pd.DataFrame(np.random.randn(6,3), columns=['col1','col2','col3']) # Standard normal distributed matrix: 6*3
df_2 = pd.DataFrame(np.random.randn(2,3), columns=['col1','col2','col3']) # Standard normal distributed matrix: 2*3

In [68]:
df_1

       col1      col2      col3
0 -0.000529  1.032864  1.538919
1  0.936251  0.565333 -2.590534
2 -1.588636  0.051853 -0.927847
3 -0.908197  1.727687 -0.555945
4 -1.549147  1.760499 -0.917105
5  0.082375 -0.429441  0.752653

In [69]:
df_2

       col1      col2      col3
0 -0.174844  0.889930 -0.152981
1 -1.214408  0.926423 -0.826123

In [70]:
df_2.reindex_like(df_1) # reindex_like copies index from one dataframe to the other

       col1      col2      col3
0 -0.174844  0.889930 -0.152981
1 -1.214408  0.926423 -0.826123
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [71]:
df_2.reindex_like(df_1,method='ffill') # using ffill fills all the NaNs with the previous values

       col1      col2      col3
0 -0.174844  0.889930 -0.152981
1 -1.214408  0.926423 -0.826123
2 -1.214408  0.926423 -0.826123
3 -1.214408  0.926423 -0.826123
4 -1.214408  0.926423 -0.826123
5 -1.214408  0.926423 -0.826123

In [73]:
df_2.reindex_like(df_1,method='ffill', limit=3) # Providing limit value forces the dataframe not to fill all NaNs by previous values, rather fill it upto a number

       col1      col2      col3
0 -0.174844  0.889930 -0.152981
1 -1.214408  0.926423 -0.826123
2 -1.214408  0.926423 -0.826123
3 -1.214408  0.926423 -0.826123
4 -1.214408  0.926423 -0.826123
5       NaN       NaN       NaN

In [74]:
df_1.rename(columns = {'col1':'c1' , 'col2':'c2'}) # renaming columns

         c1        c2      col3
0 -0.000529  1.032864  1.538919
1  0.936251  0.565333 -2.590534
2 -1.588636  0.051853 -0.927847
3 -0.908197  1.727687 -0.555945
4 -1.549147  1.760499 -0.917105
5  0.082375 -0.429441  0.752653

In [75]:
# Video 8

import pandas_datareader.data as web # pandas_datareader is used to extract stock pricing data in dataframe format
import datetime as dt # datetime is used to input datetime values

start = dt.datetime(2015,1,1)
end = dt.datetime(2020,1,1)

apple_price = web.DataReader('AAPL', 'yahoo', start, end) # This is how we get all the pricing details of any particular stock

In [76]:
apple_price

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2015-01-02,111.440002,107.349998,111.389999,109.330002,53204600.0,99.766006
2015-01-05,108.650002,105.410004,108.290001,106.250000,64285500.0,96.955429
2015-01-06,107.430000,104.629997,106.540001,106.260002,65797100.0,96.964584
2015-01-07,108.199997,106.699997,107.199997,107.750000,40105900.0,98.324242
2015-01-08,112.150002,108.699997,109.230003,111.889999,59364500.0,102.102089
...,...,...,...,...,...,...
2019-12-24,284.890015,282.920013,284.690002,284.269989,12119700.0,282.322266
2019-12-26,289.980011,284.700012,284.820007,289.910004,23280300.0,287.923645
2019-12-27,293.970001,288.119995,291.119995,289.799988,36566500.0,287.814392
2019-12-30,292.690002,285.220001,289.459991,291.519989,36028600.0,289.522614
2019-12-31,293.679993,289.519989,289.929993,293.649994,25201400.0,291.638000

In [77]:
# Calculating a return matrix of all the daily returns of various stocks

tickers = ['AAPL','MSFT','F','MS','TSLA']
act_df = pd.DataFrame()

for ticker in tickers:
    temp = web.DataReader(ticker,'yahoo',start,end)
    act_df[ticker] = pd.Series(temp['Adj Close'], index=temp.index)
#     act_df[ticker+'_ret.'] = act_df[ticker] / act_df[ticker].shift(1) - 1

In [78]:
act_df

                  AAPL        MSFT          F         MS        TSLA
Date
2015-01-02   99.766006   41.748566  11.675119  33.933075  219.309998
2015-01-05   96.955429   41.364658  11.219061  32.872387  210.089996
2015-01-06   96.964584   40.757530  11.112647  31.925665  211.279999
2015-01-07   98.324242   41.275364  11.431887  32.381496  210.949997
2015-01-08  102.102089   42.489609  11.720727  32.863628  210.619995
...                ...         ...        ...        ...         ...
2019-12-24  282.322266  156.515396   9.311640  49.574909  425.250000
2019-12-26  287.923645  157.798309   9.291973  49.985672  430.940002
2019-12-27  287.814392  158.086731   9.203478  49.966114  430.380005
2019-12-30  289.522614  156.724243   9.095318  49.838970  414.700012
2019-12-31  291.638000  156.833633   9.144482  49.995449  418.329987

[1258 rows x 5 columns]

In [79]:
act_df_ret = pd.DataFrame()

for ticker in tickers:
    act_df_ret[ticker+'_ret.'] = act_df[ticker] / act_df[ticker].shift(1) - 1 # this is how we get the return matrix

In [80]:
act_df_ret

            AAPL_ret.  MSFT_ret.    F_ret.   MS_ret.  TSLA_ret.
Date
2015-01-02        NaN        NaN       NaN       NaN        NaN
2015-01-05  -0.028172  -0.009196 -0.039062 -0.031258  -0.042041
2015-01-06   0.000094  -0.014677 -0.009485 -0.028800   0.005664
2015-01-07   0.014022   0.012705  0.028728  0.014278  -0.001562
2015-01-08   0.038422   0.029418  0.025266  0.014889  -0.001564
...               ...        ...       ...       ...        ...
2019-12-24   0.000951  -0.000191  0.003178 -0.000592   0.014384
2019-12-26   0.019840   0.008197 -0.002112  0.008286   0.013380
2019-12-27  -0.000379   0.001828 -0.009524 -0.000391  -0.001299
2019-12-30   0.005935  -0.008619 -0.011752 -0.002545  -0.036433
2019-12-31   0.007306   0.000698  0.005405  0.003140   0.008753

[1258 rows x 5 columns]

In [88]:
act_df_ret = act_df_ret.dropna() # we need to drop the first row, as we have NaN in the first row
act_df_ret

            AAPL_ret.  MSFT_ret.    F_ret.   MS_ret.  TSLA_ret.
Date
2015-01-05  -0.028172  -0.009196 -0.039062 -0.031258  -0.042041
2015-01-06   0.000094  -0.014677 -0.009485 -0.028800   0.005664
2015-01-07   0.014022   0.012705  0.028728  0.014278  -0.001562
2015-01-08   0.038422   0.029418  0.025266  0.014889  -0.001564
2015-01-09   0.001072  -0.008405 -0.013619 -0.016271  -0.018802
...               ...        ...       ...       ...        ...
2019-12-24   0.000951  -0.000191  0.003178 -0.000592   0.014384
2019-12-26   0.019840   0.008197 -0.002112  0.008286   0.013380
2019-12-27  -0.000380   0.001828 -0.009524 -0.000391  -0.001299
2019-12-30   0.005935  -0.008619 -0.011752 -0.002545  -0.036433
2019-12-31   0.007306   0.000698  0.005405  0.003140   0.008753

[1257 rows x 5 columns]

In [89]:
act_df_ret.cov() #.cov is used to make the var-covar matrix

           AAPL_ret.  MSFT_ret.    F_ret.   MS_ret.  TSLA_ret.
AAPL_ret.   0.000245   0.000132  0.000071  0.000117   0.000132
MSFT_ret.   0.000132   0.000216  0.000079  0.000118   0.000129
F_ret.      0.000071   0.000079  0.000238  0.000137   0.000095
MS_ret.     0.000117   0.000118  0.000137  0.000275   0.000121
TSLA_ret.   0.000132   0.000129  0.000095  0.000121   0.000802

In [90]:
act_df_ret.corr() #.corr is used to make the correlation matrix

           AAPL_ret.  MSFT_ret.    F_ret.   MS_ret.  TSLA_ret.
AAPL_ret.   1.000000   0.573472  0.295544  0.449894   0.298004
MSFT_ret.   0.573472   1.000000  0.350913  0.486082   0.311284
F_ret.      0.295544   0.350913  1.000000  0.534390   0.218639
MS_ret.     0.449894   0.486082  0.534390  1.000000   0.258562
TSLA_ret.   0.298004   0.311284  0.218639  0.258562   1.000000

In [91]:
# Video 9
# moving average